const projects = [
    {
        name: '可视化工具 Viscomposer',
        company: '浙江大学',
        desc: `<p>封装图元、坐标轴、数据变换等模块，提供简洁易操作的工作面板和画布，让用户通过拖拽就能生成可视化图表。</p>`
    },
    {
        name: '全球网络可视化',
        company: '浙江大学',
        desc: `<p>整合全球AS域数据和网络设备数据，抽取其中的地理位置、网络拓扑、网络关系等数据进行可视化，并提供一套可视化交互界面供专业的分析人员使用。</p>`
    },
    {
        name: '全球数据中心动态可视化',
        company: '浙江大学',
        desc: `<p>在三维地球、二维地图上展示全球的数据中心的数据采购、交换、查询的动态，并提供多方位多角度的统计图表和可视化交互界面供专业的分析人员使用。</p>`
    },
    {
        name: '可视化大屏开发',
        company: '新华智云科技有限公司',
        desc: `<p>基于 three.js，d3.js 和 g2 开发了新华智云的几个可视化大屏，其中包括三维地球飞线、词云河流图等比较复杂的可视化图表；</p>`
    },
    {
        name: '新华知典',
        company: '新华智云科技有限公司',
        desc: `<p>展示新华智云知识图谱能力，用可视化展示海量的实体数据和新闻数据。</p>
            <p>完成系统的前端（dva + antd + d3）和后端（egg.js）开发。</p>`
    },
    {
        name: 'mgc（机器自动生成短视频）',
        company: '新华智云科技有限公司',
        desc: `<p>批量生产可视化新闻视频模板；基于 headless chrome 和 ffmpeg 将浏览器的网页内容录制成视频，并将视频片段、bgm、字幕等元素自动拼接成短视屏；</p>`
        // <span>制作 cli 工具 mgc-cli ，提高了前端模板的开发和调试效率；</span>
    },
    // {
    //     name: '酒店邦',
    //     company: '外包',
    //     desc: `<p>微信 h5，酒店行业垂直领域的知识付费应用，包括音频课程、公开课直播、后台管理系统等子模块。</p>`
    // },
    {
        name: '新华智云 demo 中心',
        company: '新华智云科技有限公司',
        desc: `<p>基于 git webhook 和 docker，实现 node、java、python 等几个类型的应用快速部署，并自动分配域名；</p>`
    },
];

export default projects;